[{"start": 0, "end": 14, "text": " Well, it's not breaking news. They're a different basketball team with a healthy hole LeBron James  15 games over 500 when he's healthy three games under 500  Creates offense for himself and his teammates. They need him"}, {"start": 14, "end": 27, "text": " They all Jeff Steph Curry what he's done over the past month and a half has been absolutely brilliant  He's as valuable as any player in this league. They play great defense and they have the ultimate home run hitter"}, {"start": 27, "end": 40, "text": " Beneath the team. It hasn't been easy this season, but both finished up the regular season strong  The Lakers ended with a five-game winning streak  And the Warriors ended with a six-game winning streak"}, {"start": 40, "end": 57, "text": " Watch out James again with that right ankle, but he played last couple of games did tweak it on Sunday  But he played very well in those final two games  And here's one of the fun matchups in this series. Anthony Davis has to take a tough shot. Well defended by Draymond green"}, {"start": 56, "end": 70, "text": " and  Obviously both teams would love to get the win tonight and give it a little extra time to heal and prepare for their opponent  As Andrew Wiggins gets inside and gets the bucket"}, {"start": 70, "end": 81, "text": " To me. He's the key they need  25 from him tonight to be able to score enough  to win  Schroeder nice play and drumming"}, {"start": 81, "end": 93, "text": " Well a big flush down the other end and that's a welcome sight for Laker fans  It's not Anthony Davis and LeBron James making every play, but you get Schroeder making plays for drumming. They can be dangerous"}, {"start": 93, "end": 108, "text": " And Bates more for three. That's good  You know Steve Kerr talking before the game knows it's a taunting task  Against the Laker team when healthy they're as good as anybody in the league, but he also knows just one game"}, {"start": 107, "end": 119, "text": " That's all you have to win. This is not a playoff series  It's a one game and move on  Schroeder's jumper ball tipped and taken by Draymond green"}, {"start": 123, "end": 137, "text": " On the season Warriors 39 and 33, but they finished  Winning 15 of their final 20 games in the regular season. Just great basketball as Wiggins  Knocks down another and he's playing with a lot more confidence. Look at that"}, {"start": 136, "end": 148, "text": " He didn't wait for Steph Curry to make a play waved everybody out of the way and took advantage of his matchup  James to Davis Davis goes right at Draymond green again. Well defended Davis thought he was hit"}, {"start": 153, "end": 166, "text": " Lakers have not been dominant at home this season clearly a lot of that had to do with missing the two players  As Curry pulls back but despite all the misses as Draymond green kicks it out to Baysmore and"}, {"start": 165, "end": 177, "text": " Baysmore from the elbow jumper way off  Looney has to throw it up and then hit the ram and it goes in Kavon Looney very aware of the shot clock about to  expire"}, {"start": 177, "end": 193, "text": " But Jeff you've talked about  Without Anthony Davis and LeBron James you were impressed as Schroeder misses impressed the way the Lakers kept being competitive  Absolutely defensively, they remained rock-solid. They just had some troubles offensively"}, {"start": 193, "end": 207, "text": " But what they've done defensively all year to be the best team in the league at that end is special  Curry throws the pass stolen by Anthony Davis and number one rated defensive team"}, {"start": 207, "end": 220, "text": " Davis for three  Rebound kept alive by drumming, but he's going to be called for a loose ball foul  Andre Drummond signed at the end of March after a buyout"}, {"start": 221, "end": 236, "text": " With the Cavaliers  This is his 22nd game started all 21 games average just under 12 points a little over 10 rebounds  But Frank Vogel says still a work in progress trying to get him comfortable and familiar with playing with his new teammates"}, {"start": 237, "end": 250, "text": " Curry to Looney  Curry using a dream on green screen nice feet inside Looney shot block  Andre Drummond with the rejection Looney was ready to throw it down"}, {"start": 251, "end": 270, "text": " James to Davis  James with the tip in with the left hand and Frank Vogel's irate. He thought David Davis got fouled again  I thought it was a good block  Curry flips it up shot too strong Looney back out the base more wide open three"}, {"start": 270, "end": 285, "text": " And  Vogel wants a timeout hot start  Such so many different matchups to look at have fun. Let's let's start with Steph Curry Jeff  How do the Lakers try and guard him? What do you think their their game plan will be?"}, {"start": 284, "end": 301, "text": " Well the thing I think for a great defensive team like the Lakers that they have to avoid is  Overreacting to Curry and leaving others open. That's what's happened to start this game  Meanwhile mark a big question for Frank Vogel and the Lakers they've got the size advantage"}, {"start": 300, "end": 317, "text": " They've got the traditional centers Golden State likes to play small ball. How do you handle that if you're Frank Vogel?  Well to me, I'd like to see him post up LeBron James. It's a smaller  Wiggins our last possessing Bayes more defending him take advantage of that size and strength creating offense for himself as an aggressive"}, {"start": 316, "end": 331, "text": " I'll for his teammates Wiggins has had a terrific year  Defensively and the Golden State the fifth rated defense in the NBA this year  Oh, I'm Wiggins with the block of James has to fire it up  And it's the side of the backboard great defensive play from Andrew Wiggins"}, {"start": 331, "end": 343, "text": " This is a great defensive play coach, but in my opinion LeBron lets him off the hook. He fades away  There's no help coming. That's one-on-one beat him on your terms go towards the basket as opposed to fading away from"}, {"start": 342, "end": 355, "text": " absolutely  Wiggins had a strong finish to the season especially after the all-star break not only the defense but averaging over 20 per game  ball deflected by Caldwell Pope"}, {"start": 355, "end": 367, "text": " Wiggins guarded by James down the other end knocks down the three  Pretty good couple of sequences for Andrew Wiggins to start his play in game. He's had a tremendous year  I mean"}, {"start": 366, "end": 379, "text": " When he's the third most important player like he was in Minnesota the year they went to the playoffs when he was there  It's a perfect role for him. I mean he's played exceptional basketball this year  Particularly the second half of the year"}, {"start": 378, "end": 390, "text": " Drummond puts it on the floor double team back out to Davis shock lock down a three James a three-pointer way off  And dream on green the rebound the Lakers have missed nine of their first 11 from the field"}, {"start": 390, "end": 406, "text": " Baysmore running gets it a loony and loony and a hell ball with Anthony Davis  I'm just thinking about it think about your third best player in the league  Absolutely, and I give Steve Kerr a lot of credit. He's narrowed his rotation. They play eight guys now"}, {"start": 405, "end": 420, "text": " There's more comfort level. They're an older team. They're experienced  You don't go far in the NBA playoffs playing all young guys  You saw clay Thompson there once that injury changed his game. He's got a lot of experience"}, {"start": 419, "end": 432, "text": " He's got a lot of experience. He's got a lot of experience  He's got a lot of experience. He's got a lot of experience  James now guarded by Baysmore Wiggins helps out Schroeder good ball movement here Caldwell Pope. Good luck knocks down the three"}, {"start": 433, "end": 445, "text": " And that's what they want out of that double team  I would rather stunt at Anthony Davis stay at home with Caldwell Pope and make Anthony Davis  Shoot and make threes you see Schroeder"}, {"start": 444, "end": 456, "text": " He's got a lot of experience and he's got a lot of confidence and he's got a lot of confidence  At home with Caldwell Pope and make Anthony Davis shoot and make threes you see Schroeder initially on Steph Curry"}, {"start": 455, "end": 472, "text": " There'll be a number of players James with the deflection, but Wiggins able to get it back  shot clock down to four Wiggins pull up three  And drumming rips down the rebound drumming one of the premier elite rebounders in the game throughout his career"}, {"start": 474, "end": 487, "text": " Caldwell Pope off balance  and  James goes down the lane the runner and draws the foul on Baysmore"}, {"start": 491, "end": 502, "text": " Well, they get the switch and then they double and they full rotate  That's a long closeout by Wiggins again. I would have rather stunted off of"}, {"start": 502, "end": 517, "text": " Caldwell Pope and made Anthony Davis  Shoot the long ball and  Mike did we have starting lineups earlier? Yes, I wish they were  Sponsored by Taco Bell, and I could have said sponsored by taco fall"}, {"start": 517, "end": 530, "text": " I'm surprised you waited so long to take your first shot, man. You didn't come up for breath. So I  It's the free throw but congratulations to you on"}, {"start": 530, "end": 544, "text": " Truly a Hall of Fame career. It was an honor to be at your induction. Absolutely well-deserved and an incredible speech  You made us proud partner. Thank you gentlemen, but this is a fact I couldn't have done it without you, man"}, {"start": 543, "end": 557, "text": " We don't need to hear that. That's fake hustle. That's like saying  Curry couldn't have done it without  Jordan Bell, come on  Why can't you just say thank you to as well? Thank you. No, no, you don't mean that don't say thank you"}, {"start": 557, "end": 570, "text": " He's not sincere man, it's about him  Walker's lead by six  Shrewder guarding curry again curry launches a three-pointer that one off the bark for the rebound long Toscano Anderson"}, {"start": 570, "end": 585, "text": " Draymond green tries a three that mrs. Drummond hauls in another rebound  Michael Mulder also in the game for Golden State. Here's Baysmore"}, {"start": 585, "end": 597, "text": " Mulder runs to the corner, but Baysmore banks. It won't go to Scott. Oh Anderson misses the tip here comes James  Schroeder corner three James the offensive rebound"}, {"start": 600, "end": 614, "text": " Quick move inside draws the contact shot won't go but a foul and he will go right back to the free-throw line  But I don't want to sound like a broken record  But that's the type of plays he's got to make especially the way that they're defending and I understand coming off injuries trying to feel"}, {"start": 613, "end": 629, "text": " His way through the game, but as we move closer and closer towards getting involved into this game  I expect to see LeBron a little bit more aggressive  Now you see those two games the last two of the regular season did tweak again the ankle on Sunday, but nothing serious"}, {"start": 630, "end": 654, "text": " I  James missing a career-high 27 games only played 45 games said those 20 consecutive out or at the ankle injury"}, {"start": 653, "end": 665, "text": " Now  Playing in the play-in game where he famously said Weber came up with this should be fired. I  Think the whole thing has been pretty exciting"}, {"start": 665, "end": 676, "text": " Curry on the drive flips it up back shot is good Steph Curry with his first field goal coach  Just look at the size difference between these two teams on the floor right now at every position"}, {"start": 675, "end": 688, "text": " Position  James finds Caldwell Pope another corner three another one knocking it down Caldwell Pope"}, {"start": 689, "end": 704, "text": " Two for two from three-point range  Welcome back to Warriors Lakers now  If you see LeBron James go to the bench a little more often than usual in this first half"}, {"start": 703, "end": 717, "text": " Coach Frank Vogel told me that's because the more minutes LeBron plays the more his ankle tends to stiffen up  So they are going to try if they don't fall too far behind here to backload his minutes and keep him under 30 total"}, {"start": 716, "end": 729, "text": " Now you just saw the play back in March where he got initially hurt. This is where he tweaked it again  Just three days ago LeBron told us he hasn't stopped thinking about the way this injury derailed his season"}, {"start": 728, "end": 740, "text": " He had to rehab for more than six weeks and said quote. I hated every moment of it  But Mike he said he's ready to move forward and he doesn't anticipate his movement being limited in any real way tonight"}, {"start": 740, "end": 756, "text": " Thank You Rachel you forget how well he was playing  Prior to the injury how well the Lakers were playing prior to the injury to James and Davis  They were 21 and 6 Caruso wide open nobody near him and he cans the three"}, {"start": 756, "end": 768, "text": " And they did on  That one stay at home on Caldwell Pope, but Caruso shot the ball very well from three this year  Draymond Green gets inside and draws the foul"}, {"start": 768, "end": 780, "text": " Andre Drummond  Green shaken up  Well good stunt by Baysmore"}, {"start": 780, "end": 801, "text": " but Caruso  Again really improved as a three-point shooter  So green will go to the line  Green has had an outstanding season especially defensively when he gets the first our upcoming national TV schedule TNT tomorrow"}, {"start": 801, "end": 813, "text": " Indiana and Washington  That game  After Indiana with the victory Washington losing to Boston then ESPN Friday Memphis will play the loser of this game"}, {"start": 812, "end": 827, "text": " It's a 9 Eastern start and it'll be either in San Francisco or here at the Staples Center  Tell you Indiana played a great  Offensive game Wow down three of their main guys so bonus"}, {"start": 827, "end": 839, "text": " He's a great  great offensive player  absolutely  They started off great and did not let their foot off the gas pedal  Davis out to Kuzma Kyle Kuzma Montrezl Harold in the game"}, {"start": 839, "end": 851, "text": " Draymond Green on Davis one-on-one excellent defense again stolen by Baysmore  Baseball goes right at Davis throws up a wild shot and draws the foul"}, {"start": 850, "end": 862, "text": " Anthony Davis picking up his first that is outstanding defense by Draymond Green one-on-one against Anthony Davis for the second time  You just you just battle them"}, {"start": 861, "end": 876, "text": " And you stay in front and don't give him anything easy active hands  Secure your position be disciplined and give your team a chance exactly what he did  Well base more in the starting lineup"}, {"start": 876, "end": 890, "text": " As Golden State has some injuries Kelly who Bray still out with a left wrist. He's gonna be re-evaluated next week James Wiseman  Of course their center out for the season with right knee surgery Damian Lee also out and of course that man"}, {"start": 889, "end": 903, "text": " Missing his second consecutive year  Can't wait to see him back in uniform running up and down the floor  And they need him and you look at this game for example  The war is not gonna win if Steph Curry doesn't get going at some point"}, {"start": 902, "end": 915, "text": " The Lakers are forcing him to get rid of the basketball where he sees bodies in front of him  The sky no Anderson misses the three called ball Pope the rebound  They're doing a good job of keeping two people. He comes off a pick and roll"}, {"start": 914, "end": 927, "text": " They don't leave him until he gets rid of the basketball  Stuff Curry's taking just three shots so far  Mulder some early minutes guarding Caruso  Caldwell Pope nice screen set by Davis"}, {"start": 927, "end": 940, "text": " Step-back jumper won't go  Green has been absolutely great defensively  Curry against Kuzma there's a double-team second turnover by Curry"}, {"start": 940, "end": 954, "text": " Kuzma to Caruso drives inside lefty lamp is good. It's goes crashing Frank Vogel again saying where is the whistle?  A lot of contact there  And Caruso off the bench with five points"}, {"start": 956, "end": 968, "text": " Active hands come up with the steel and good delivery by Kuzma  Russo with the finish that's clearly contact. He should be going to the line  Curry doubled again"}, {"start": 968, "end": 979, "text": " Raymond green fakes Davis right there  Five on the 24 curry fakes the three gets away from Davis off one foot too strong  And here comes Kuzma"}, {"start": 978, "end": 994, "text": " Lakers have made it difficult early for Steph Curry  Kuzma a three-pointer  And a loose ball fouls gonna go against curry  And coach you know people who say well, how can you get them going?"}, {"start": 993, "end": 1007, "text": " Well, you can get them going by getting stops defensively and pushing the basketball is tough enough  When you're pushing it in transition and a technical foul, I believe on dream on green  Green gosh, Tivinson. I don't want to hear it"}, {"start": 1008, "end": 1020, "text": " You're now trying to talk  Whatever happened to the parent that says I don't want to hear and then you still talking they said I said  I don't want to hear it. That's the end of it. He just gave him an extra candy bar"}, {"start": 1019, "end": 1034, "text": " That foul by the way was on Mulder not curry as Davis hits the technical free throw and now  Much more pleasant conversation  Josh Tivin and I have a difference of opinion of what no more means"}, {"start": 1036, "end": 1055, "text": " Josh Tim has become one of the premier officials in the NBA in recent years and you get a chance to talk to him  He's a great guy. He's a great guy. He's a great guy. He's a great guy  Josh Tim has become one of the premier officials in the NBA in recent years and you get a technical and since we don't count this"}, {"start": 1054, "end": 1071, "text": " As the playoffs, it doesn't count against any suspension so you can these are freebies  Sure, they're in there up top to Caruso  And throws it out about so you're talking about the play in stats do not count toward the regular season and do not count"}, {"start": 1070, "end": 1086, "text": " Toward the playoffs they kind of fade away I suppose but it's also you know, it's the same for the broadcast  One it's not it's not recorded. He does that anyway, Mike. I'm just saying they should count  I saw Jason Tatum's 50 as Mulder dumps it counts"}, {"start": 1086, "end": 1099, "text": " Put him in the postseason. This is the postseason. I'm in agreement with you  I think they're uh, they're trying to figure out what's the best way. I just figured it out for him  I'm, just saying what they're thinking curry on the rebound Davis's miss"}, {"start": 1099, "end": 1112, "text": " Curry way downtown in and out and Davis the rebound  So  Lakers shooting just 32 percent from the field, but they're only down by three"}, {"start": 1114, "end": 1125, "text": " Mantras harrell spins flips it up shot won't go tip by kuzma and another offensive rebound, which he's been doing all season  Schroeder misses the three"}, {"start": 1124, "end": 1142, "text": " And curry the rebound curry averaged a career high five and a half rebounds per game this year  Gets inside draws the foul count it and one  And  To me that's the most underrated two things about his game the rebounding aspect and the finishing aspect"}, {"start": 1143, "end": 1160, "text": " That's just beautiful  Touch around the rim this year he became the oldest scoring champion in the nba in 23 years  When michael jordan was 35, he finished the season with 46 points on sunday against memphis"}, {"start": 1160, "end": 1175, "text": " He was just absolutely sensational of course a lot of the talk this week lebron james saying the other day  About stuff curry. He's the mvp. He had the best season all year  Well, he's had an incredible season and it's it's a joy to cover him and watch him as davis"}, {"start": 1175, "end": 1186, "text": " Knocks down the little floater. He was 0 for 6 anthony davis before that shot and it's back to four  But I like what he did instead of posting screen on the ball"}, {"start": 1186, "end": 1199, "text": " And get some space from green  Juan, toscano anderson knocks down a three turns and says something to the fans and runs down the floor  He is one been a one of the great stories this year in the nba"}, {"start": 1199, "end": 1202, "text": " the"}, {"start": 1200, "end": 1216, "text": " Oakland native now playing for his team that he grew up rooting for  Schroeder shot blocked to Scott O'Anderson saves it, but right to Harrell blocked by green but a foul  And two free throws coming up for LA"}, {"start": 1219, "end": 1234, "text": " See the great ball movement  Young fella gets it done Oakland's finest  Proud to be a warrior. Well, there's happy ending for him. He just signed a multi-year contract to play for the team again. He"}, {"start": 1235, "end": 1253, "text": " Growing up rooted for his undrafted out of Marquette back in 2015 took him five years to get to the NBA  Mexico Argentina Venezuela the G League  And he has become so much more than an energy player Bob Myers absolutely loves him. He's got terrific skill"}, {"start": 1252, "end": 1267, "text": " He's extremely smart Draymond Green says he changes the game with his intensity and Steve Kerr says I trust him  Been a great story and he's the one guy that can do Draymond Green type things on the floor"}, {"start": 1266, "end": 1282, "text": " initiating offense setting screens extra pass  What a find by the Warriors  Steve Kerr actually calls him a mini Draymond Green. You think I just freestyled that Mike? Well, I wanted to give"}, {"start": 1282, "end": 1298, "text": " C'mon, Looney the rebound six-point Warriors lead  There's about a five-second difference between the shot clock and game clock  Murray just two four six to start"}, {"start": 1299, "end": 1314, "text": " Mulder Wiggins  Rebound Schroeder final seconds. No fouls to give here Schroeder ahead to Davis Davis three pointers up shot short  Welcome back to the State Farm NBA play in tournament"}, {"start": 1313, "end": 1328, "text": " I'm Rachel Nichols here with coach Steve Kerr great start you guys got out to Steve. What was working for you?  Well, I thought our defense was really good Rachel and it's been good  You know the last few weeks and that's that's what we have to play off of so our guys did a good job"}, {"start": 1328, "end": 1340, "text": " What's your approach to the size disadvantage that your team has here tonight?  Well, we just got to make sure everybody's engaged all the time and you know, keeping everyone off the glass  They're obviously"}, {"start": 1339, "end": 1351, "text": " Much bigger and stronger than we are, but if we're active and we're boxing out with all five guys we can hold our own  Thanks so much Steve. All right back to you Mike. Thank you Rachel fifth turnover for Golden State"}, {"start": 1353, "end": 1365, "text": " James five points in that first quarter tailing Horton Tucker out there with James Schroeder Kuzma and Harold  Horton Tucker straight on three. That's good. This young man's having"}, {"start": 1365, "end": 1378, "text": " An excellent season in terms of taking some steps  But the three-pointer has been at times a struggle for him nice shot there and it's a three-point game  Jordan pull the floater"}, {"start": 1378, "end": 1389, "text": " Looney's follow misses Harold the rebound no curry. No green with James on the floor  This is gonna be a challenge  James drives"}, {"start": 1388, "end": 1407, "text": " Can't get it come on Looney grabs another rebound seven rebounds already for Kavon Looney  They'll need him with the size advantage of the Lakers  Mulder catch and shoot that's good three-pointer from Mulder. He can shoot the second-year guard from Kentucky"}, {"start": 1407, "end": 1420, "text": " Oh, you look at this unit on the floor for the Warriors right now  No curry or green, but they have the ability to compete at a high level spread the floor and they have shooting all around  Schroeder drives Schroeder mrs. Looney grabs another defensive rebound"}, {"start": 1422, "end": 1436, "text": " And interestingly they have Toscano Anderson on Schroeder  Pool has it eight to shoot Toscano Anderson"}, {"start": 1435, "end": 1450, "text": " Not that time fight for the rebound come on Looney nine rebounds now already another three  Mulder can't get it to go  Six-point goal in state lead with two minutes into the second"}, {"start": 1451, "end": 1468, "text": " They played each other three times  Warriors won the first game Lakers two blowouts after that, but both teams obviously so radically different now  Kuzma"}, {"start": 1468, "end": 1485, "text": " Kuzma and hit one of the wires atop the backboard, so it's Golden State ball  Stop curry talking about the Warriors who said back in in February March"}, {"start": 1484, "end": 1497, "text": " It was a little bleak, but he's so proud of the way this team just kept fighting  And he says now we've given our children's elves a chance to make this season matter curry and green the leadership they showed"}, {"start": 1497, "end": 1511, "text": " The Warriors turned it around  The Skano Anderson feet inside  Looney shot in and out LeBron James rips down the rebound that's outstanding possession no great ball movement"}, {"start": 1510, "end": 1522, "text": " Making plays for one another just wasn't able to finish. It's a Skano Anderson like you mentioned before mark and really  pass and make plays  Montrezl arrow"}, {"start": 1521, "end": 1535, "text": " foul by Looney  And the former six-man winner with the Clippers will go to the line  It has not been an easy adjustment for Montrezl last year played so well for the LA Clippers this year"}, {"start": 1534, "end": 1548, "text": " He's had some some good stretches his numbers are solid not playing as many minutes not getting as much touches  But it's been inconsistent at times well three centers makes it a challenge for the coaching staff and for the three players"}, {"start": 1547, "end": 1560, "text": " And I think the thing if I'm if I'm Harold my mentality has got to be  The way I got paid and made it in this league I gave great energy great effort great enthusiasm from day one"}, {"start": 1559, "end": 1574, "text": " So I was a difference maker because of the way I went about my business  He's got to get back to being that then he's a handful to defend  And I think it's interesting too. I think the challenge going forward for the coaching staff is at times last year"}, {"start": 1573, "end": 1585, "text": " They played with as a free throw rebounds given up. They played with Anthony Davis at center  So now that they have three other centers. Do you ever get back to that lineup right?"}, {"start": 1584, "end": 1600, "text": " It's basically four centers that all feel they deserve time Horton Tucker goes inside flips it up and an offensive foul is called  Or Tucker picks up the personal Frank Vogel obviously disagrees with the call"}, {"start": 1600, "end": 1613, "text": " Morton Tucker wants to see the replay  A  Lot there  To me that's not a defensive foul, but it's not an offensive foul either"}, {"start": 1613, "end": 1627, "text": " Pull to Wiggins Wiggins trying to slam a shot block Horton Tucker right there minimum of the rim and then a foul  as Wiggins goes crashing to the floor I  Like Wiggins trying to attack like that"}, {"start": 1627, "end": 1639, "text": " Attacking the rim  Good job of going vertical  But I like like you talked about here  They need him to be aggressive on the offensive end"}, {"start": 1639, "end": 1653, "text": " Foul was on Caruso  Russo picks up his first  Here's pool and pool is about before any shot attempt Crusoe trying to fight over the screen picks up his second"}, {"start": 1652, "end": 1664, "text": " You have to treat Jordan pool the way you treat Steph Curry with that first unit because he's a guy that can get hot and  Then the rim opens up for him  Well, the last six games averaged 20 a game"}, {"start": 1664, "end": 1677, "text": " He had a career-high 38 last week  With curry on the bench Frank Vogel said he's kind of taking over the like the CJ McCollum  Role in terms of when Lillard goes to the bench McCollum has to score they need pool to score"}, {"start": 1676, "end": 1699, "text": " Not that he was comparing him to CJ McCollum  Horton Tucker short on the three  Here's pool inside the arc"}, {"start": 1698, "end": 1710, "text": " Six on the 24 Wiggins against Caruso nice spin move and finish from Andrew Wiggins  He's got nine points. He has a great right to left spin"}, {"start": 1714, "end": 1727, "text": " Harold  Knocked away ball picked up to the left  He's got nine points. He has a great right to left spin  And  Harold"}, {"start": 1726, "end": 1742, "text": " Knocked away ball picked up to Scott O'Anderson  Two on one break goes right at LeBron James and finishes  And a timeout call by Frank Vogel  They got a lot of doubt down there. We got we got a lot of belief the job guys. Good quarter. Good quarter"}, {"start": 1742, "end": 1753, "text": " Holding on on the boards defending without fouling all good stuff  He has been proud of this team talked about, you know disjointed early obviously the injury to Clay Thompson"}, {"start": 1753, "end": 1772, "text": " He said that they've come together really well as the season went on. He kept telling the team late in the season  We're gonna go on a run. We're gonna go on a run and they finished 15 and 5 in those last 20 games  And I like how Wiggins is picking up full court on occasions James drives gets inside block by Toscano"}, {"start": 1772, "end": 1784, "text": " Anderson knocked out of bounds still Laker ball  And  This is just good verticality boys kid is tough"}, {"start": 1785, "end": 1795, "text": " Warriors have five block shots already  James gets inside bank shot missed it ball tipped out to Scott O'Anderson pushing it up the floor"}, {"start": 1800, "end": 1812, "text": " older pool to Scott Anderson out there with Looney in Wiggins  Wiggins fires a three way off and it's Laker ball.  And you look at this game right now with seven minutes going in"}, {"start": 1811, "end": 1823, "text": " the second quarter.  One team is getting after it like they want it and the other  team is in chill mode and if you're the Lakers you have to  respond because the Warriors are here to advance to Sunday."}, {"start": 1822, "end": 1835, "text": " Kuzma gets that one to go prior to that shot.  The Lakers were shooting 24% from the field.  They had missed eight shots in a row.  That's a very strong assertive move by Kuzma."}, {"start": 1838, "end": 1855, "text": " Wiggins to Looney.  Toscano Anderson can't get the three.  Montrezl Harrell with the board.  James finds Montrezl Harrell inside and throws it down in a"}, {"start": 1854, "end": 1868, "text": " crowd.  And it's a three point shot for the Warriors.  First field goal.  And a timeout call by Steve Kerb."}, {"start": 1867, "end": 1879, "text": " The Warriors are shooting 38%, 29 from three and Steph Curry has  five points.  Both these teams, their defense has been a big part of their"}, {"start": 1878, "end": 1890, "text": " success.  As we mentioned, Lakers number one defensive rating and the  Warriors number five.  Good.  Top shot from Jordan Poole."}, {"start": 1889, "end": 1901, "text": " Lakers looking to push the other way.  Steve Kerb talked about that.  He wants his team to really push the tempo tonight.  Schreuder gets some room.  Davis tries the three."}, {"start": 1902, "end": 1915, "text": " Davis has not shot the ball well from three since his return from  the camp injury.  Curry finds some room, gets inside, draws the foul.  Banker won't go.  He's mad at himself but he'll get two free throws."}, {"start": 1914, "end": 1926, "text": " And that's two straight pick and rolls that Drummond has been  ineffective in defending.  He's got to get down a little bit lower.  He has great feet."}, {"start": 1925, "end": 1938, "text": " He can do this but he can't reach and get himself out of  position.  Curry has talked this year.  It's the best he's felt physically and the best he is"}, {"start": 1937, "end": 1950, "text": " seeing the game this year.  And the year off last year might have helped that as well."}, {"start": 1949, "end": 1960, "text": " Only five games played with a broken hand.  There's no question it re-energized him.  You know players will talk about this.  Guys who play in the finals year after year.  The grind of that.  LeBron James."}, {"start": 1959, "end": 1971, "text": " That's one of the unbelievable things about what he's able to  do.  It's almost like another season.  And it has recharged him.  Dennis Schroeder trying to get going.  Still looking for his first field goal."}, {"start": 1970, "end": 1982, "text": " Throws it away.  Great with the steal.  That's great pick and roll defense.  I mean that superior ability to play two,"}, {"start": 1981, "end": 1993, "text": " play the ball handler and play the roll man.  You see Schroeder's got his feet on the ground,  his feet on the ground."}, {"start": 1992, "end": 2003, "text": " He's got his feet on the ground.  You see Schroeder, he's got to come off to score.  Green stunning at him and recovering.  That's beautiful."}, {"start": 2002, "end": 2013, "text": " That's outstanding.  Steve Kerr talks about it all the time.  He knows what the opponent is running.  He blows up opponents' plays all the time."}, {"start": 2012, "end": 2023, "text": " Nice feet inside, but Bazemore rushed it.  Although Davis' presence had something to do with that.  Caldwell pulled three-pointer.  Short.  Right back to him.  Up top to Schroeder."}, {"start": 2025, "end": 2036, "text": " Caldwell poke pass inside.  Broke it up.  Bazemore this time got a hand on it.  Boy, active hands again from the Warriors.  Poole explodes to the rim and finishes."}, {"start": 2035, "end": 2053, "text": " Jordan Poole, his second field goal,  and it's back to a ten-point Warriors lead.  The Lakers have 30 points,  and there's under five to play in the first half.  Schroeder fakes."}, {"start": 2052, "end": 2063, "text": " Caruso barely had it in his hand.  Knocks down the three.  I'm looking at that last possession.  Anthony Davis has Kent Bazemore on him,  and comes out to send a high-screener roll.  A side-screener roll."}, {"start": 2062, "end": 2073, "text": " Oh, give me the basketball.  It's your time to be a little bit more aggressive.  Lascano-Anderson.  Bazemore fakes.  Drives on Caruso."}, {"start": 2072, "end": 2084, "text": " Leans in on Drummond.  Flips it up.  Way off.  And an offensive foul is gonna be called on Anthony Davis,  and Frank Bogle hot once again."}, {"start": 2084, "end": 2095, "text": " Well, right now, Draymond Green is putting on a master's class  on how to defend.  He has taken Anthony Davis out of the ballgame."}, {"start": 2094, "end": 2105, "text": " Now, that's just a smart play.  He puts himself in position to take the hit,  but he is in the head of Anthony Davis thus far.  And some joy going on right now,"}, {"start": 2104, "end": 2116, "text": " and a technical foul handed out.  Double technical.  John Goble came in, I believe.  It's on Davis and Toscano-Anderson.  The Warriors are saying,  why is it a double technical?"}, {"start": 2118, "end": 2130, "text": " If you're Draymond Green,  you don't want to get caught in this.  You already have a technical foul yourself.  So it is on Davis, but the other one's on Poole.  Jordan Poole."}, {"start": 2129, "end": 2140, "text": " That's like the old line,  when the NCAA got really mad at Kentucky,  they put Cleveland State on probation.  Curry for three."}, {"start": 2139, "end": 2151, "text": " His first three-pointer of the half,  and from way downtown,  and it makes it a 10-point game again.  But Davis is now at the five position."}, {"start": 2152, "end": 2164, "text": " And LeBron James back in.  Schroeder 0 for 6.  Schroeder 0 for 7.  It's James guarded by Toscano-Anderson."}, {"start": 2168, "end": 2180, "text": " Leans in.  Excellent defense.  Throws it away.  Boy, this Cleveland State defense,  as you said, Mark,  they're putting on a clinic here in the first half.  Five to shoot for the Lakers."}, {"start": 2188, "end": 2218, "text": " Caruso.  Shot clock winding down,  and Poole with a foul with 3.4 remaining on the shot clock.  Davis gets that one to go."}, {"start": 2217, "end": 2229, "text": " Just his second field goal.  He was 1 for 9 prior to that,  and it's an 8-point game.  Despite the horrific shooting by the Lakers,  especially their stars,  again, they're only down 8."}, {"start": 2228, "end": 2239, "text": " Curry.  Another three.  Back-to-back threes for Steph Curry.  Now he's got 12.  And this equals the largest lead of the first half."}, {"start": 2241, "end": 2254, "text": " Wiggins back in.  Now Curry switches on James.  Two former MVPs.  Davis against Wiggins."}, {"start": 2254, "end": 2265, "text": " Davis settles for the jump shot  and a rebound to Toscano-Anderson.  Green, beautiful pass ahead.  Toscano-Anderson stripped by Caldwell Pope."}, {"start": 2267, "end": 2280, "text": " Schroeder tries a three.  And Schroeder still without a field goal.  James to Davis.  Davis blocked.  Green got a piece of it.  And the Warriors go the other way.  Another forced turnover by Golden State."}, {"start": 2279, "end": 2291, "text": " Curry gets inside.  Blocked by Schroeder.  Here comes Caruso the other way.  Caruso almost tried an alley-oop to himself  but somehow managed to get the layup to go."}, {"start": 2290, "end": 2304, "text": " He did alley-oop it to himself.  Got away with it.  Which is fine.  You can throw it up.  But I tell you what,  Green not giving James a dunk  to me is next-level intelligence."}, {"start": 2304, "end": 2316, "text": " Draymond Green.  Cross-court to Poole.  Poole for three.  Knocks it down.  Eighth three-pointer for Golden State.  Now the Golden State Warriors"}, {"start": 2315, "end": 2328, "text": " showing once again  why they've been one of the best defensive teams  in the NBA this season  led by Draymond Green.  And guys, you gotta figure,  you've watched so much basketball,  he's one of the smartest defensive players I've seen"}, {"start": 2327, "end": 2338, "text": " in all my years covering the NBA.  Well, I had the privilege of coaching him  so I'm well aware from day one  his instincts,  his intelligence,  superior."}, {"start": 2339, "end": 2351, "text": " True to the drive.  Nearly another forced turnover  but Caldwell Pope has it.  And a whistle and a foul.  Let's check in with Rachel.  Mike, this is so interesting.  According to all the tracking data we have now,"}, {"start": 2350, "end": 2361, "text": " if you look over the past eight years,  no one has defended Anthony Davis  on more plays than, yep,  Draymond Green.  So Draymond told me  that that means there's no surprises."}, {"start": 2361, "end": 2374, "text": " AD knows all of his little tricks.  He knows all of Anthony's.  Instead, he said, quote,  what it's gonna boil down to in this game,  it boils down to heart.  It boils down to who wants it more.  It boils down to who can outthink the guy,"}, {"start": 2373, "end": 2384, "text": " other guy, on a particular play.  He said, it's not that I will go and say,  I don't know what he's capable of.  I know what he's capable of, Draymond said.  It's can I stop him?"}, {"start": 2383, "end": 2395, "text": " And as you guys have noted,  tonight we've seen a clinic.  Draymond's been doing that work, Mike.  Thank you, Rachel.  As Wiggins picks up the foul,  James hits the free throw.  He just seems to shine come playoff time."}, {"start": 2395, "end": 2398, "text": " He lives for these type of games,  these type of matchups."}, {"start": 2400, "end": 2415, "text": " knows also coach he knows that and it's his advantage it comes down to heart and  it's no disrespect to Anthony Davis but he has a fight his chance in that  situation if it boils down to talent it's Anthony Davis all day long"}, {"start": 2414, "end": 2427, "text": " Lakers shooting 30% from the field 29% from three and they have 38 points with  a minute I have to play in the second curry three-pointer too strong rebound"}, {"start": 2426, "end": 2448, "text": " Caruso Davis comes back to Caruso pull over Caruso and his headband knocked now  James and Wiggins Caldwell Pope corner three is up shot no good and Wiggins"}, {"start": 2447, "end": 2460, "text": " with a rebound and great block out by Toscano Anderson you don't see blocking  out but he eliminated Davis's size with that block out Wiggins nice turnaround"}, {"start": 2459, "end": 2474, "text": " shot wouldn't go James looks to lead the break the other way pass inside Caruso  layup tough shot able to get it off the glass Caruso is their leading score and  their only player double figures with 12 and that's a good sign of you the"}, {"start": 2473, "end": 2488, "text": " Golden State Warriors game plan this and I like this lineup with Davis at 5 a lot  more from a spacing standpoint pool cross-court Toscano Anderson with five"}, {"start": 2487, "end": 2504, "text": " to shoot and hits the three-pointer launch Toscano Anderson eight points off  the bench back to 12 with 25 seconds remaining the three leading scores for"}, {"start": 2503, "end": 2516, "text": " the LA Lakers James Davis and Schroeder three for 27 from the field Schroeder the  drive layup is good tough shot he finally gets one to go he was 0 for 8"}, {"start": 2515, "end": 2530, "text": " and I'm not allowing Steph Curry to play one-on-one in this situation either are  they Curry step back three bang at the buzzer Steph Curry from downtown and the"}, {"start": 2529, "end": 2543, "text": " Warriors will take a 13-point lead into halftime  what a first half for Golden State defensively putting on a clinic and then"}, {"start": 2542, "end": 2560, "text": " Curry coming alive from three-point range in the second period  Bayes Moore steps back three-pointer way off rebound Looney but he's called for a"}, {"start": 2559, "end": 2573, "text": " push Looney by the way had 11 rebounds in that first half as he picks up his  second coach if I was Dennis Schroeder LeBron James Anthony Davis looking at  what we talked about the impact in that first half I'd cut off the coach the"}, {"start": 2572, "end": 2587, "text": " coach's speech in the locker room at halftime and I look and say I've got to  be better I've got to do a better job of taking care of my business forget about  what's on the board again considering those numbers they're fortunate to be"}, {"start": 2586, "end": 2599, "text": " only down by 13 as we've seen in the NBA 13 points is not a huge deficit to  overcome there's a shot clocks down to four Schroeder drives on Wiggins and a"}, {"start": 2598, "end": 2613, "text": " foul I'll take it on the side we'll send it over to Rachel well Mike I'm told  there was plenty of excitement as the Warriors piled into the locker room  coming off that great step shot to close the first half but I'm also told it only"}, {"start": 2612, "end": 2625, "text": " lasted about 15 seconds and then Steve Kerr got everyone to buckle down and  refocus no major adjustments for the Warriors but he did tell the team  prepare for the Lakers to make some runs here they're a championship team"}, {"start": 2624, "end": 2637, "text": " we just have to weather them meanwhile over on the Lakers side the coaching  staff told players they got to be more physical against this water squad they  do have that size advantage but they also told the guys just relax we're"}, {"start": 2636, "end": 2647, "text": " missing wide open shots just ease into it here these are shots that you can  make Mike thank you Rachel is dream on green picked up the foul initially Josh"}, {"start": 2646, "end": 2660, "text": " Tivins said it was on the floor but talked with his fellow officials they  change it to the act of shooting no he got bullied by LeBron James into asking  well that's that's the real deal that's another way of putting it and they"}, {"start": 2659, "end": 2678, "text": " changed the call and I'm not saying it wasn't the right call I'm saying that's  why they discussed it and I would have a different message for the Lakers I  wouldn't say relax I would say we're too relaxed let's do something no doubt"}, {"start": 2677, "end": 2692, "text": " Warriors look like the hungry team curry saves it the right to shoot her on an  errand pass from green and here comes James James gets into the paint mid-range  jumper shot won't go loony another rebound quick outlet to curry curry to"}, {"start": 2691, "end": 2704, "text": " base more attacks the rim layup shot no good  Golden State looking to push it every opportunity"}, {"start": 2703, "end": 2715, "text": " Schroeder draws the foul shot won't go but Steph Curry will pick up his second  personal and that's been a problem for Golden State all year which is fouling"}, {"start": 2714, "end": 2727, "text": " too much and to start this half they haven't made them make shots they put  Schroeder to the line twice sure missed 14 days down the stretch with the health"}, {"start": 2726, "end": 2757, "text": " and safety protocols played the last two games but his conditioning is far from  where it should be  Schroeder led the team in scoring when LeBron James was out mark they need him"}, {"start": 2756, "end": 2767, "text": " to be super aggressive absolutely out of pick and rolls in transition at their  best he's that third option and at times carries them offensively curry to green"}, {"start": 2766, "end": 2778, "text": " green try to jam it James and drumming right there James down the other end  lamp lock a foul count it and one still went down and a chance for a three-point"}, {"start": 2777, "end": 2790, "text": " play and suddenly it's just a seven-point game with a free-throw the  coach a recipe for disaster if you're the Warriors allowing the Lakers to get  to the free-throw line turning the basketball over and giving them easy"}, {"start": 2789, "end": 2805, "text": " opportunities in transition sometimes teams in this league frustrate me but  what the Utah Jazz just did by giving out 52 full ride scholarships to"}, {"start": 2804, "end": 2818, "text": " underserved kids is a home run that the whole league should adopt absolutely  when the players were calling the kids I looked at that video and I was"}, {"start": 2817, "end": 2833, "text": " absolutely so proud of Utah and the players I just thought it was brilliant  so special for those young men and women as Wiggins spins and banks at home back"}, {"start": 2832, "end": 2844, "text": " up to eight for Golden State Warriors have led the entire game Lakers have not  led the largest lead is 13 right now 57 49 Caldwell Pope to James James kicks it"}, {"start": 2844, "end": 2856, "text": " out Caldwell Pope off the bounce running lap is good sweet move from contagious  Caldwell Pope he's got eight points and I like that offensive set by Los Angeles"}, {"start": 2856, "end": 2870, "text": " having James as the screener when he's the screener it is really hard to guard  pick and roll curry behind the back flips it up and whittles short as Davis  grabs the rebound and especially the screener with curry involved it puts you"}, {"start": 2869, "end": 2884, "text": " in the dilemma defensively James to Davis Davis three-pointer won't go  Lakers just five of 19 from downtown Golden State has hit twice as many"}, {"start": 2883, "end": 2895, "text": " threes dangerous pass stolen by Caldwell Pope  Caldwell Pope down the other end layup block but a foul Ramon Green upset after"}, {"start": 2894, "end": 2908, "text": " the turnover the Caldwell Pope will shoot a couple of free throws but again  when we're talking about a team that's struggling to score you're giving them  opportunities carelessness on the offensive end by the Warriors and"}, {"start": 2907, "end": 2925, "text": " they're already the Lakers are already in the penalty so they're shooting the  rest of the quarter while LA hasn't committed a team foul  Golden State already five team fouls and Caldwell Pope's numbers one of these"}, {"start": 2924, "end": 2942, "text": " teams tonight will earn the seventh seed in the West and the right to get into  the NBA playoffs and you can watch the NBA playoffs starting Saturday on ABC  ESPN TNT and NBA TV the winner tonight will face Phoenix that game one will be"}, {"start": 2941, "end": 2957, "text": " Sunday time to be determined in Phoenix against the Suns just a spectacular  season they finish second Utah finish one these two teams in the plan Schroeder"}, {"start": 2957, "end": 2971, "text": " against Wiggins playing physical Wiggins spins tied up shot clock at five green  another turnover as Davis brings it into the frontcourt back up Schroeder puts up"}, {"start": 2970, "end": 2987, "text": " the three puts it in Dennis Schroeder just his second field goal and it's a  one-point game you get into rhythm at the free-throw line so he caught a  rhythm at the free-throw line and now he knocks in the three and a foul down the"}, {"start": 2986, "end": 2999, "text": " other end crowd doesn't like it there's about 6,000 fans here at the Staples  Center tonight and this is just a wide open catch-and-shoot three and Mike you"}, {"start": 2998, "end": 3003, "text": " mentioned 6,000 fans"}, {"start": 3000, "end": 3013, "text": " I also love that they have they were able to get more fans because they have what a vaccinated section. Yep  I love that  Curry step back three-pointer and his foul"}, {"start": 3013, "end": 3029, "text": " Schroeder commits the personal that's going to be his first and curry will shoot three free throws  And I thought he kicked out his leg I would really think about challenging that"}, {"start": 3030, "end": 3043, "text": " He does get into that landing it  And like you talked about the winner playing the Phoenix Suns want to say congratulations to coach Monty Williams who the coaches"}, {"start": 3043, "end": 3055, "text": " Voted him as the coach of the year. Yep his season in NBA a job well done and an award well-deserved  Absolutely terrific job, and I love their whole team attitude. They weren't trying to"}, {"start": 3054, "end": 3070, "text": " Absolutely terrific job, and I love their whole team attitude. They weren't trying to  Manipulate the standings a whoever comes our way comes our way  How about the season Chris Paul has had for that team?"}, {"start": 3070, "end": 3084, "text": " Meanwhile these two coaches a little chess match right now  Curry hits all three lead back up to 4  18 points for curry as a successful coach in this league for so many years"}, {"start": 3083, "end": 3097, "text": " Did you ever try to manipulate the standings and see who you was going to match up with now?  I just I had like just whether I was right or wrong that whole  Karma as Anthony Davis takes another three"}, {"start": 3096, "end": 3108, "text": " I just didn't believe in it if you want to if you're if you're a championship mentality  I just think you got to play everybody  Blocked by Looney Drummond tried to get it to go"}, {"start": 3107, "end": 3121, "text": " He thought he was fouled again the initial dream on green defense on Davis forced him to pass it  Wiggins step back jumper got it  Andrew Wiggins now with 13 points about the move by Wiggins. That's not an easy shot"}, {"start": 3121, "end": 3133, "text": " No, but he's got that right to left spin  Wiggins one-on-one with LeBron James who's just two of nine from the field"}, {"start": 3133, "end": 3145, "text": " Jumper is good  He's got a look at it like it's disrespectful as good a defender as Wiggins is you're gonna play me one-on-one  Recognize who I am take it personal"}, {"start": 3145, "end": 3158, "text": " Schroeder gets right up into curry curry splits the defense dangerous pass stolen by Caldwell Pope  That's nine turnovers  now for the Warriors"}, {"start": 3157, "end": 3175, "text": " Four of them already here in his third quarter. We played just five minutes  Schroeder baseline jumper is short  Curry triple-team finds Looney"}, {"start": 3175, "end": 3188, "text": " Touch pass to Baysmore corner three is good Baysmore with his third three-pointer  And now Frank Vogel wants a timeout the lead right back up to seven the eleven three-pointer for Golden State"}, {"start": 3189, "end": 3201, "text": " You know what I'd like to  The sweatsuits that the Warriors are wearing with paying homage to Oakland  That's pretty that's pretty good. I love that"}, {"start": 3203, "end": 3218, "text": " Drummond hands off Caldwell Pope and double-team him Davis swings it now Schroeder across the lane shot clock down to seven  Schroeder given some room hesitated shot clock of two Caruso on the drive on the pull-up shot way off"}, {"start": 3218, "end": 3231, "text": " And a 24-second violation another excellent defensive sequence from Golden State  But I thought Schroeder cooperated he had a couple of shots that he turned down instead of being aggressive"}, {"start": 3230, "end": 3242, "text": " And I'll tell you what I find interesting didn't they say?  Before the game that they wanted to limit LeBron James to 28 or 30 minutes. He only has eight minutes left"}, {"start": 3241, "end": 3258, "text": " He's sitting right now. He played 17 and a half minutes in the first half  And 22 overall so  Wiggins against Caruso Wiggins nice feet inside Looney gathers and"}, {"start": 3258, "end": 3270, "text": " Throws up a shot off the glass just his second field goal, but Looney's played some excellent defense that he has 12 rebounds  And they missed him earlier in the possession by green on a slip"}, {"start": 3271, "end": 3291, "text": " Drummond across the lane flips it up and in  Four points for Drummond  Curry gets away from the double team continues left-handed off the glass won't go chipped in by Kavon Looney"}, {"start": 3294, "end": 3311, "text": " Looney part of those championship teams. He's got the corporate knowledge  Drummond calling for one-on-one with Looney spins in the paint falls down lost it and a base more fouled by Schroeder"}, {"start": 3311, "end": 3327, "text": " And if I'm the Warriors you're doing me a favor  Posting up drumming against Looney. I know he scored the last possession, but if I'm Anthony Davis  I've got to look to be aggressive and demand the basketball. This is not this is not a winning recipe coach"}, {"start": 3327, "end": 3343, "text": " I I agree if you can get them to post Drummond  That plays away from their strength, but again, I like this  Inserting the highly intense Wes Matthews and putting Anthony Davis at the center position"}, {"start": 3342, "end": 3360, "text": " Matthews his first minutes tonight curry long-distance hits a three Steph Curry his fourth three-pointer of the game  It's back up to a dozen  Toscano Anderson and Mulder back in now stripped by green and stolen ball loose picked up by curry knocked out of his hands by Caruso"}, {"start": 3360, "end": 3376, "text": " Caldwell Pope to Caruso  Cross-court Matthews Matthews for three  Talk about an instant contribution  And that's a huge turn of events up 12 all the momentum going in transition curry"}, {"start": 3375, "end": 3392, "text": " Turns it over and then a three Caruso steal on that an important play  And then a foul called on Caldwell Pope Frank Vogel I rate again  I'm looking at the sideline, and you see greatness and Drake and Michael B. Jordan. Just shaking their head"}, {"start": 3392, "end": 3405, "text": " As chef curry with the shot and the response Caruso to Matthews  knockdown shot  giving the Lakers life  Matthews in his first year and there they are"}, {"start": 3406, "end": 3418, "text": " Sitting courtside Draymond green block by Davis Anthony Davis sensational defensive play  And  Green usually gets a layup of game off that fake"}, {"start": 3418, "end": 3434, "text": " To curry Davis calling for it gets it inside shots good and one  Davis at both ends and a chance for a three-point play  Coach is what you're talking about putting Davis at the five so the screen and roll takes Draymond green off of him puts a smaller"}, {"start": 3433, "end": 3447, "text": " Anderson on him he can have his way gets the contact and the finish well, and there's room to move and  Post here he starts it off. That's a tremendous  Block shot, but it starts with the lineup construction"}, {"start": 3447, "end": 3458, "text": " That with four perimeter players surrounding Davis he can go in there without Drummond or another center  clogging it up"}, {"start": 3457, "end": 3469, "text": " Anthony Davis only 36 games played during the regular season missed 36  30 of them with that right calf  30 of them with that right calf"}, {"start": 3468, "end": 3485, "text": " He was starting to show signs last final games of the season at that 42 point game against Phoenix  He has struggled so far tonight, but still a long way to go  Six point Warriors lead four minutes to play pass inside the curry missed the layup, but a foul"}, {"start": 3484, "end": 3495, "text": " We got to show that that is brilliance moving without the basketball and not a foul a goaltending  That's right marks up two points for curry. It's just so good"}, {"start": 3496, "end": 3518, "text": " What if more guys were willing to move at the speed and the consistency of curry they'd be rewarded to  Matthews misses  Curry stumbles a bit keeps his dribble alive against Davis lost it ball deflected and a backcourt violation"}, {"start": 3519, "end": 3532, "text": " Well curry's been loose with the ball  This quarter, but this is brilliant comes off the initial screen sets it up like he's gonna come off the stagger back cuts  that's just"}, {"start": 3532, "end": 3549, "text": " Well Anthony Davis was saying you know usually when a guy gives up the ball the defender can relax a little bit he goes  But that's when Steph Curry is his most dangerous after he gives up the ball  I know I said it before but think about it you add clay Thompson who moves in a similar form and fashion"}, {"start": 3548, "end": 3559, "text": " The pressure that they put on your defense collectively is unmatched in the history of this game  Matthews to Davis guard of I to Scano Anderson green looking to help"}, {"start": 3560, "end": 3576, "text": " Davis spins contested shot way off  that one at the side of the backboard and green gets the rebound a  well-timed double team by  Green on the baseline side Davis now three four sixteen to Scano Anderson pass the base more"}, {"start": 3578, "end": 3589, "text": " Lot of contact over in the far side base more three-pointer won't go Davis the rebound  Under three to play here in the third"}, {"start": 3592, "end": 3597, "text": " Alex Caruso goes all the way blocked by green baseball or the other way"}, {"start": 3600, "end": 3615, "text": " Draymond green again, just putting on a defensive clinic  Plus six assists  Five rebounds gets inside layup. He missed it  Ball knocked out of bounds still golden state ball green thought he was fouled"}, {"start": 3618, "end": 3630, "text": " As caruso turning the corner  Sees green  That's outstanding defense and help by draymond green has been doing it all night long. That's his third block"}, {"start": 3630, "end": 3646, "text": " He's got a good shot  Warriors have eight to shoot jordan pool has come in  Lebron james back in  Pass inside to wiggins stolen by james. That's the seventh turnover here in the third"}, {"start": 3645, "end": 3659, "text": " They only had five the first half kuzma to davis  The fast break can be lethal for the lakers and they've cut the deficit to six and the warriors lose this game  They're going to look at this quarter and recognize. This is where it happened"}, {"start": 3659, "end": 3678, "text": " Carelessness on the offensive end another turnover, but warriors get it back wiggins for three  Under two to play third quarter here on this play-in game kuzma backdoor layup is good"}, {"start": 3680, "end": 3695, "text": " Timeout golden state  This one has been terrific the marquee matchup of the play-in is not disappointed"}, {"start": 3696, "end": 3715, "text": " Curry tied up gets it inside the green green to wiggins wiggins hard off the glass won't go the chip is up and good  Boy wiggins playing with a force tonight at both ends. He's got 15. It's a six-point warriors lead"}, {"start": 3719, "end": 3732, "text": " Matthew's cuts looking for davis  James three-pointer puts it in  his first three-pointer"}, {"start": 3731, "end": 3743, "text": " Of the night and it's a three-point game, but you look at the post-up play where wiggins had a one-on-one. He shoots a  fade away one leg a shot  Now knocks down a three that's good defense. Sometimes you just got to give credit to greatness"}, {"start": 3742, "end": 3754, "text": " Oh curry beautiful pass, but wiggins couldn't handle it and kuzma comes the other way  Lob it in davis throws it down lakers within one"}, {"start": 3760, "end": 3778, "text": " Boy is it fun to hear a large crowd the noise of that once again curry on the drive  Curry for three. That's good. Steph curry from way downtown his fifth three-pointer of the night. You know, how tough a shot that was"}, {"start": 3778, "end": 3791, "text": " I mean  other great nba players  Can't shoot that he is one of a kind  On that type of pass it sprint catch and fire"}, {"start": 3792, "end": 3803, "text": " James back door to caruso another backdoor cut leads to a layup  But there's more space on the floor now  That the traditional center is out"}, {"start": 3803, "end": 3819, "text": " And so there's more cutting avenues no fouls to give here for the lakers dream on green wide open for three  Welcome back to the state farm nba play-in tournament here with coach frank vogel frank"}, {"start": 3818, "end": 3830, "text": " What do you attribute that lockdown defense in the third quarter? You really forced a bunch of warriors turnovers  Yeah defense has been pretty good most of the night. Um, you know, we ratcheted it up a little bit in that quarter"}, {"start": 3829, "end": 3841, "text": " We know that steph's quarter to get going still hit a few bombs on us  Uh, you know, we gotta live with that but you know, our guys are motivated and you know  We take pride in being number one defense in the league and we're gonna mean it's not a stretch here"}, {"start": 3840, "end": 3852, "text": " Do or die fourth quarter a playoff berth on the line. You've got steph curry on the other side  What do you tell your guys got to execute?  Okay, just that's what you got to worry about execute our defensive coverages and get a good shot every time down"}, {"start": 3851, "end": 3864, "text": " Thank you so much  All right, rachel james the rebound after the beautiful feed to davis to tie the game  opening minute here fourth quarter  warriors"}, {"start": 3863, "end": 3879, "text": " Largest lead was 13 early in the third  And the warriors did a good job when curry and green rested  In the first half, but this is danger zone right now james inside bank shot missed it and kevin looney could not quite hold on"}, {"start": 3879, "end": 3890, "text": " And it's laker ball with 14 now on the shot clock  And I love this substitution of draymond green coming back in that's just a beautiful pass to davis"}, {"start": 3890, "end": 3902, "text": " You need to match green's minutes with davis  Kuzma trying to get free and they lob it into kuzma over a pool lays it up and in"}, {"start": 3902, "end": 3918, "text": " And the lakers with their first lead of the night  How long does steve kerr leave steph curry out of this ball game  That's the ninth assist from lebron james molder to pool"}, {"start": 3918, "end": 3932, "text": " Bulls been excellent off the bench down the stretch of the regular season. No, it's a whole different ball game  Mulder harassed and stolen by caruso the turnovers continue to mount the second half for the warriors"}, {"start": 3932, "end": 3945, "text": " And this is where wiggins was stationary that entire position  He's got to be great when curry rests james drives on toscano anderson layup banks at home"}, {"start": 3945, "end": 3966, "text": " time out golden state  So  Wiggins battling with matthews matthews an excellent defender throughout his career"}, {"start": 3966, "end": 3980, "text": " Wiggins trying to draw a foul didn't get the whistle  We said a lot about the lake the warriors turning the ball over you got to give credit to this lake of defense  They have increased the value  And I think it starts with who you're playing. So wes matthews"}, {"start": 3980, "end": 3997, "text": " He has been intense as james goes in with the reverse  And there's more room on the floor  A six-point lead that's a 19-point turnaround here in the second half curry looking toscano anderson driving layup"}, {"start": 3997, "end": 4013, "text": " offensive foul james draws the charge  And davis falls on top of him  And I think steve kerr may be challenging this and that's a block"}, {"start": 4014, "end": 4029, "text": " But it is going to be a challenge  So they'll challenge those guys will get up and we'll see what happens  Eight points five rebounds off the bench"}, {"start": 4030, "end": 4044, "text": " So  It's only the 11th and 12th free throws of the game for goal in state  Second half so far  They haven't played mantras harrell. They haven't played"}, {"start": 4044, "end": 4056, "text": " port and tucker  They've gone with a very tight rotation  Steve kerr has only played eight players"}, {"start": 4056, "end": 4071, "text": " And james  Karras  Davis  Matthews  His team trails by five two and a half gone by in the fourth caruso the drive"}, {"start": 4071, "end": 4084, "text": " Davis the tip won't go to scotto anderson the rebound again. Draymond green contesting the shot  Curry back into green"}, {"start": 4086, "end": 4100, "text": " Good transition defense though from the warriors kuzma the drive can't finish  Wiggins barrels into matthews offensive foul"}, {"start": 4101, "end": 4116, "text": " Boy, what a call from frank vogel to get west matthews off the bench  He has really had an impact as a coach  You have to have guys that you trust that when is when it matters most  I know exactly what they're going to do and west matthews has been proven to be a competitor at an elite level"}, {"start": 4116, "end": 4130, "text": " And a guy that has no quit and he has come out and got it done on the defensive end, especially  This is why they signed him. It's his first year with the lakers  He's 34 his 12th year in the league. The lakers are his seventh team. He's always been an excellent defensive player"}, {"start": 4130, "end": 4144, "text": " tough fearless  rob palenka  Wanted to bring him for these kind of games. There's certain matchups. You need him defensively. He can also hit a three  Competitors only apply"}, {"start": 4143, "end": 4158, "text": " It's hard to find great competitors west matthews is  Davis jump shot. Got it. Anthony davis has come alive in the second half  The laker lead is seven"}, {"start": 4159, "end": 4172, "text": " Curry for three answers  Steph curry with a six three-pointer. He's got 29  So they clear the whole side eliminate the help and allow steph curry to win his matchup one-on-one and caruso"}, {"start": 4171, "end": 4188, "text": " Was substituted out of the game  Curry on davis isolated there on the elbow wiggins looking to help paul comes over to help  Matthew's inside kuzma shot clock at four kuzma tough fall away shot in and out"}, {"start": 4188, "end": 4201, "text": " Now the fight for the rebound goes to draymond green  Curry on the drive scoop layup. He banks it home. Oh, what a sweet move from curry  31 points"}, {"start": 4200, "end": 4212, "text": " and it's a two-point game.  And Poole just pushing Matthews out of the way."}, {"start": 4211, "end": 4222, "text": " That's gonna be the first team foul here on the fourth.  No Caruso harassing him.  Schroeder inserted into the game.  Steph Curry knocks down a three, gets a rhythm,  and keeps them off balance."}, {"start": 4221, "end": 4234, "text": " Turns the corner.  Spectacular finish before the contest.  An efficient game for Curry.  10 of 18 from the field, six of nine from three.  Davis left alone for three."}, {"start": 4233, "end": 4244, "text": " Got it!  Anthony Davis, his first three-pointer of the night.  He was 0 for five, and it's back to a five-point Laker lead.  Get a couple layups, get a dunk,"}, {"start": 4243, "end": 4256, "text": " and now the jump shot becomes a little bit easier.  He struggled from three-point range all season long.  Just 26%."}, {"start": 4255, "end": 4269, "text": " Well, good find by James as Green  tries to take away the roll.  Always chatting away is Trayvon Green."}, {"start": 4270, "end": 4282, "text": " Curry gets free, drives inside, scooped layup, missed it.  He thought he was hit.  Steve Kerr is furious.  Here's James the other way.  Long three-pointer.  Karams out to Mulder."}, {"start": 4283, "end": 4295, "text": " Jordan Poole, oh, beautiful crossover!  Tried to jam it, ball knocks loose out of bounds,  and it's gonna be Warriors' ball.  That would've been quite the highlight for Jordan Poole."}, {"start": 4296, "end": 4310, "text": " I'm giving him a point just for the move.  And he got fouled.  How is that not a foul?"}, {"start": 4310, "end": 4325, "text": " Why are you looking at me?  I'm not reffing.  Wiggins, Poole on the inbound, and it's back to three.  Trudeau brings it up with 6.43 remaining."}, {"start": 4326, "end": 4339, "text": " LeBron James sitting right now.  Well, he's at his minute limit.  I wonder if we'll see him again.  Entry pass knocked away by Trayvon Green."}, {"start": 4338, "end": 4353, "text": " Poole ahead to Wiggins.  Wiggins drives, floats it up, shot is good!  19 points for Wiggins, and it's back to one.  Timeout, L.A.  Marv Albert, the greatest basketball announcer of all time,"}, {"start": 4352, "end": 4365, "text": " whose impact on aspiring broadcasters is immeasurable.  Congratulations, thanks for a spectacular career,  Marv Albert.  And I'm one of those guys."}, {"start": 4364, "end": 4377, "text": " Three years with Marv Albert as a partner,  congratulations, legend.  Poole misses, screen dives, Kuzmino comes up with it.  Just past the midway point of the fourth."}, {"start": 4376, "end": 4388, "text": " Schroeder draws the foul, shot won't go.  I'm just trying to imagine you as a head coach  of the Lakers right now,"}, {"start": 4387, "end": 4401, "text": " what the looks you would be giving LeBron James,  like basically asking him, are you ready yet?  No, I wouldn't be giving him dirty looks.  I'd be giving that whoever's in charge  of the minutes police, I'd be like, come on now."}, {"start": 4400, "end": 4411, "text": " We'll give him off tomorrow and the next day  as Caruso is gonna come back in to the game.  Schroeder has struggled tonight,"}, {"start": 4410, "end": 4424, "text": " just two of 11 from the field,  but hits the free throw, Lakers back up two.  Caruso will come in and Matthews sits,  11 minutes for Matthews, he made his presence felt."}, {"start": 4424, "end": 4436, "text": " I think the key obviously was the Lakers activity,  but I think Frank Vogel found for this game,  Davis at five, playing huge minutes, already up to 36"}, {"start": 4436, "end": 4447, "text": " and going to Wes Matthews was a huge factor  in their swarming defense.  Schroeder goes one for two."}, {"start": 4449, "end": 4461, "text": " Caruso back in the guard, Curry.  Finds Wiggins, Wiggins gets inside,  draws the contact and banks it home.  Chance for a three-point play.  Big plays from Wiggins on both ends of the floor tonight."}, {"start": 4462, "end": 4474, "text": " And unselfishness of Steph Curry,  takes the double team, gets rid of the basketball.  Wiggins aggressive, turns the corner.  And if you're anybody on a Lake is not defending Curry,  you have to pull all the way over"}, {"start": 4473, "end": 4486, "text": " so he doesn't have ability to catch and finish.  Wiggins wants to get the victory,  get back in the game,  get the victory, get back in the playoffs.  He's only been in the playoffs once  in his first six years in the league."}, {"start": 4485, "end": 4497, "text": " That was five games in the first round  with Minnesota in 2018.  He has had a terrific season.  He's played 71 of the 72 games in the regular season.  And here in the play end,"}, {"start": 4496, "end": 4507, "text": " 21 points on 10 of 18 from the field.  He's available every game, every year.  He plays all the time,  as durable as any player in this league."}, {"start": 4507, "end": 4521, "text": " Kuzma back out to Schroeder.  Shot clock at three, puts up the three,  shot won't go, one of the foul.  Davis, the offensive rebound, back up and banks it home.  But there's an awful lot of contact,"}, {"start": 4520, "end": 4532, "text": " not just on the shot,  but also Davis's rebound and finish.  Anthony Davis discarded people.  Curry reverse with the English off the glass.  Little more magic from Steph Curry."}, {"start": 4531, "end": 4545, "text": " He's got 33.  And LeBron James is coming back in.  Schroeder drives inside.  Caruso missed the layup.  Curry the rebound.  Curry to Wiggins."}, {"start": 4546, "end": 4562, "text": " Jordan pulled.  Nope, they wave it off, an offensive foul.  On a screen set by Draymond Green,  not allowing the chase down contest.  James will return."}, {"start": 4562, "end": 4576, "text": " Three fouls on Green.  LeBron James returns.  And credit to Anthony Davis for not giving up on the play.  So his effort to try to get to the shooter forced that call."}, {"start": 4576, "end": 4589, "text": " That's 12 second half turnovers for Golan State.  They only had five in the first half.  They led by 13 at halftime.  Lakers have taken the lead here on the fourth."}, {"start": 4588, "end": 4600, "text": " They've led by as many as seven.  Right now, all tied with four and a half to play.  This is a tough play to guard.  The curl by Davis.  Davis knocked away another steal from Draymond Green."}, {"start": 4599, "end": 4613, "text": " And Mulder in the front court.  Three steals, three blocks for Green.  Curry on the drive, gets inside.  Foul on jumper, no good.  11 rebounds for Davis."}, {"start": 4612, "end": 4624, "text": " To go with 21 points.  Mulder up and into Schroeder.  Drives, layup, shot is good.  Oh, what a tough shot from Schroeder.  And Draymond Green wanted a push off."}, {"start": 4629, "end": 4640, "text": " Green's gotta be careful with the referees.  He already has a technical tonight.  Gets the pass from Curry.  And he's got it.  And he's got it.  And he's got it."}, {"start": 4639, "end": 4650, "text": " And he's got it.  And he's got it.  And he's got it.  And he's got it.  He gets the pass from Curry.  Pull for three.  He puts it in.  Warriors back up by one."}, {"start": 4649, "end": 4663, "text": " And that's where Green is great.  You blitz Curry,  and you get it to Green and he plays four on three.  He's a great, great decision-maker."}, {"start": 4662, "end": 4676, "text": " And it may boil down to just that.  Other guys not named Curry making shots,  being ready and aggressive.  Because the Lakers are forcing Curry  to get rid of the basketball.  Dennis Schroeder tries, drives on Wiggins,"}, {"start": 4675, "end": 4690, "text": " flips it up, shot no good.  Rebound, rebound Draymond Green.  And here come the Warriors up one with 3.15 remaining.  Curry fakes, Curry drives, floats it up, banks it home."}, {"start": 4690, "end": 4702, "text": " Timeout Lakers.  Here's the upcoming national TV schedule.  TNT tomorrow, Indiana and Washington at 8 Eastern."}, {"start": 4701, "end": 4712, "text": " For the right to get into the playoffs,  the Lakers will play the Warriors  in the ESPN on Friday.  Memphis, winning earlier tonight against San Antonio,  will play the loser of this game."}, {"start": 4712, "end": 4725, "text": " And it'll be at 9 Eastern.  For more on these games, visit nba.com or the NBA app.  This has been a thriller here at the Staples Center.  Anthony Davis and the Lakers came back from 13 down."}, {"start": 4724, "end": 4737, "text": " Took a seven point lead here in the fourth,  but Steph Curry erupting here in the fourth.  He's got 35 for the game.  And it's the Warriors up three.  And he decides to sit Schroeder"}, {"start": 4736, "end": 4747, "text": " and reinsert Wesley Matthews.  I think it's the right move.  Absolutely.  They gotta make an adjustment  because the Warriors clearing a side for Curry."}, {"start": 4746, "end": 4759, "text": " They have to recognize that defensively the Lakers do  and be in position to help.  James looking to post up Baysmore.  Squares and faces, seven on the shot clock."}, {"start": 4758, "end": 4770, "text": " Wiggins looking to help.  James, four on the 24.  Rebound Matthews.  Back out to James.  Pass to Caruso.  Corner three.  Side of the backboard and Baysmore gets the rebound."}, {"start": 4771, "end": 4784, "text": " I talked about it earlier.  Wiggins forcing LeBron into that shot.  That's a shot you're willing to give up  if you're the Warriors defensively  against a bigger, stronger LeBron.  And Caruso's defense forces the turnovers."}, {"start": 4783, "end": 4795, "text": " Curry dribbles it out of bounds.  And Caruso inside to Davis.  The runner.  No good but a foul.  That's absolutely inexcusable.  On a turnover, they didn't get matched up."}, {"start": 4794, "end": 4800, "text": " So Green had to rotate to the wide open Caruso  and now Davis gets fouled."}, {"start": 4800, "end": 4842, "text": " So Paul picks up his third and  Anthony Davis will shoot free  throws.  Two for two tonight.  It's only 74 percent.  During the season.  It's a big second half for"}, {"start": 4841, "end": 4858, "text": " Davis.  Only got five points at  halftime.  18 in the second half one point  game under two and a half  remaining.  Curry on the drive the floater"}, {"start": 4857, "end": 4870, "text": " in the paint short Wiggins tips  for pass to Caruso back to James  and he's fouled Draymond Greene  would not let him get a layup  and James goes down holding his"}, {"start": 4869, "end": 4882, "text": " head the officials discussing I  think they're going to take a"}, {"start": 4881, "end": 4895, "text": " look at it to see if it's a  flagrant.  I think it's a flagrant foul.  I think it's a flagrant foul.  And there's contact to the head"}, {"start": 4894, "end": 4908, "text": " of LeBron James to be  interesting to see the  conclusion that they come up  with here but there's clearly  with the right hand of Draymond  Greene to the head.  Goes up the block."}, {"start": 4907, "end": 4920, "text": " This is a huge call again  because it will be free throws  and it will be a flagrant foul.  Clearly to me there was contact"}, {"start": 4919, "end": 4931, "text": " on the head according to the  rule but not everything to the  head is a flagrant foul.  You need to make up your mind  sir.  No I I don't think it is one.  I think it will be called one."}, {"start": 4930, "end": 4942, "text": " And I hate when games are  decided on these like.  Influenced by like these like  they're trying to split the atom  and they're trying to split the"}, {"start": 4941, "end": 4953, "text": " game.  Absolutely.  You have covered every base by  the way my friend.  Well done.  James obviously shaken up by the  play.  So.  He's going to get two free"}, {"start": 4952, "end": 4963, "text": " throws and he's going to get two  free throws and will they get  possession and he's smart enough  to.  Make sure they know he's hurt.  Upon review a couple of thousand"}, {"start": 4962, "end": 4975, "text": " called on Green.  I'm going to name my next son  John Gopal.  Thank you John.  And.  I mean.  I mean.  I mean.  I mean.  I mean.  I mean.  He's he's he's he's already back"}, {"start": 4975, "end": 4986, "text": " to the NBA.  You know and again part of it.  It's just such a.  Crucial call for.  I mean he's looking he's going  up to block the shot hands down"}, {"start": 4985, "end": 4997, "text": " I think with Steve said.  There's no wind up.  And the impact is because James  comes into him.  And I'm not going to take I'm  not going to explain myself to  the whole L.A. roster."}, {"start": 4997, "end": 5012, "text": " Play ball.  I don't know if it's because of  the.  Ripley lip reading but I think  he just said something about.  Trouble seeing.  Again as Steve Javis said it was"}, {"start": 5011, "end": 5023, "text": " an awkward fall and that made it  look worse than it was and  apparently got poked in the eye  to.  My only problem with it it  wasn't a contest to the  basketball.  It was a contest to the face"}, {"start": 5023, "end": 5035, "text": " because he can't jump as well.  And.  I think.  That.  That.  Ties the game with two oh seven"}, {"start": 5034, "end": 5047, "text": " remaining.  I've been there before squinting  my eyes just in case I miss a  free throw so I have an excuse.  I've been there.  At a rough first half but has"}, {"start": 5046, "end": 5058, "text": " made huge plays here in the  second half a triple double.  Misses the second.  And a loose ball foul is going  to go against LeBron James  Jordan pool did a good job"}, {"start": 5057, "end": 5069, "text": " getting the ball out of the  field.  And.  He's going to be able to get  the ball out of the field.  And really you look right now  both teams are shooting the rest  of the way.  So if you're going to be  physical defensive you have to"}, {"start": 5068, "end": 5082, "text": " be physical and disciplined also  where you don't give up free  throws.  Each team with one timeout left  and as Mark said both teams in  the penalty.  Baysmore to pull."}, {"start": 5082, "end": 5093, "text": " Wiggins Green and Curry.  And an offensive foul call on  dream on green on the moving  ball.  And.  It's a foul.  Steve Kerr can't believe that"}, {"start": 5092, "end": 5104, "text": " call.  Nor can green who picks up his  fifth.  And that's not a legal screen to  me that's Wes Matthews selling  the foul.  He's had an."}, {"start": 5104, "end": 5117, "text": " Important impact on this second  half.  Caldwell Pope.  Back up to James.  Wiggins has done an excellent  job defensively on him tonight."}, {"start": 5116, "end": 5128, "text": " And.  He's got a great pass to Caruso  Caruso on the drive inside  Davis for the slam.  Lakers back up to with a minute  and a half to play.  And Caruso has been outstanding."}, {"start": 5127, "end": 5138, "text": " Outstanding.  Great find.  Curry the drive looking to draw  contact and he does but they say  before the shot doesn't matter  they're in the penalty."}, {"start": 5138, "end": 5151, "text": " So two free throws for Curry to  tie the game with one twenty  three left.  Well they go back to putting  Steph Curry into the pick and  switch it James came off touched  it to Caruso who just caught it"}, {"start": 5150, "end": 5162, "text": " on a stampede to the basket and  dropped it off to Davis Anthony  Davis who had an awful first  half has come alive twenty five  points including."}, {"start": 5163, "end": 5175, "text": " Thirteen here in the fourth  quarter as Curry hits the free  throw and played forty one  minutes so far.  Twelve rebounds as well and has  made some excellent defensive"}, {"start": 5174, "end": 5185, "text": " plays in the second half this  game has been so much about  defense from both teams.  Curry ties the game."}, {"start": 5186, "end": 5202, "text": " Thirty seven points for Steph  Curry.  They get a call while Pope"}, {"start": 5201, "end": 5213, "text": " almost lost it shot clock at  seven.  James two defenders on him to  call while Pope inside he's  tied up by green throws it back  up top James puts up the three.  Oh it's gone."}, {"start": 5212, "end": 5224, "text": " LeBron James from downtown.  That's the shot clock expires.  A desperation heave and the  Lakers are up three."}, {"start": 5228, "end": 5239, "text": " Green back to Curry.  Curry sets leans in.  He's got a shot clock at seven.  He's got a shot clock at seven.  He's got a shot clock at seven.  Knocked away get it back from"}, {"start": 5238, "end": 5249, "text": " Curry shot clock at seven.  Baseball on the drive kicks it  out.  Pull for three.  James the rebound with thirty"}, {"start": 5248, "end": 5261, "text": " two seconds remaining.  There's about a 10 second  different shot clock and game  clock they don't have to foul.  LeBron James I'm putting my head"}, {"start": 5260, "end": 5273, "text": " down and attacking.  I'm going to foul.  I'm not letting him shoot a  three.  They have a timeout left but  won't call it here.  Curse trying to call it.  And finally he gets it.  Steve Kerr came to half court."}, {"start": 5273, "end": 5284, "text": " The officials couldn't see him  or clearly couldn't hear him.  And he gets the timeout with two  point one remaining.  We'll see if the officials look  to see to perhaps put more time"}, {"start": 5283, "end": 5295, "text": " on the clock.  The Lakers are up three.  James the rebound with thirty  two seconds remaining.  They got a great look the last"}, {"start": 5294, "end": 5306, "text": " time by Jordan Poole in the  corner of a nice pass by  Basemore.  LeBron James with the three  pointer had to throw it up the"}, {"start": 5305, "end": 5317, "text": " shot clock was expiring.  It's a big time shot.  Awful execution.  Realizes that the clock went"}, {"start": 5316, "end": 5329, "text": " down the good chase down by  Curry and.  LeBron.  Elevates.  Knocks down the biggest shot of  the night.  That's a 30 footer.  And you see Curry.  Who's had that look on."}, {"start": 5329, "end": 5340, "text": " Opponents faces after he knocks  down threes the same look as  LeBron James with a clutch shot.  Still talking about his."}, {"start": 5340, "end": 5352, "text": " Difficulty seeing after taking  that shot in the face from  Draymond Green.  All right guys obviously.  Golden State.  Needs a three pointer here to  try and force overtime."}, {"start": 5352, "end": 5364, "text": " And for the Lakers there's not  enough time for them to foul and  not allow a three pointer  correct.  It depends on where the ball is  caught.  And in what position.  I wouldn't be surprised if"}, {"start": 5363, "end": 5376, "text": " Curry.  Is used to try to free somebody  else up.  Because of.  Teams natural reaction to him.  No matter.  What type of cut he makes."}, {"start": 5375, "end": 5387, "text": " And that guy defending the  basketball in LeBron James  in this scenario.  I'd keep my eyes on Curry.  Days more to inbound.  Pool coming free Curry trying to"}, {"start": 5386, "end": 5398, "text": " get free lost the ball.  That's it.  The Lakers are in the playoffs.  The Warriors need to play on  Friday.  What a thriller here at the  Staples Center."}, {"start": 5400, "end": 5415, "text": " And the crowd is going wild.  What a show these two stars put"}, {"start": 5414, "end": 5426, "text": " on tonight.  LeBron James.  With his vision.  Bothered after that shot from  Draymond Green.  Hits the desperation he."}, {"start": 5426, "end": 5437, "text": " That proved to be the game  winner.  For the first time in history.  Lakers will play Phoenix on  Sunday.  The Warriors will play the"}, {"start": 5436, "end": 5451, "text": " Grizzlies on Friday night to  keep their season alive.  And the respect from the two  former MVP.  Warriors with an opportunity but."}, {"start": 5451, "end": 5463, "text": " A defensive play ends this one  and that's perhaps appropriate  with all the terrific defense we  saw tonight.  Here's a look at the replay.  This is."}, {"start": 5463, "end": 5476, "text": " He didn't even catch it in  rhythm.  Just unbelievable.  Just as the shot clock expired.  And he was blind.  James."}, {"start": 5476, "end": 5487, "text": " With twenty two points eleven  rebounds ten assists.  And the game winning three  pointer.  Is with Rachel.  LeBron congratulations on the"}, {"start": 5486, "end": 5498, "text": " win.  And.  We're going to go ahead and  introduce you to.  Anthony Davis.  You already know.  What does this mean to you guys  to be officially in the play in"}, {"start": 5497, "end": 5509, "text": " bracket and the playoff bracket  and to do it with this kind of  win tonight over a team that has  really been such a huge rival  for you over the second half of  your career.  Well I mean going into the  postseason I think it's two of"}, {"start": 5508, "end": 5519, "text": " the hottest teams I think we're  winner of five they were winner  of seven or eight or whatever  the case may be.  So both teams playing at a high  level and.  We knew that they're going to  be a tough game for us to win.  You know they hit us in the"}, {"start": 5518, "end": 5530, "text": " mouth in the first half and we  just had to respond and we did  that on the defensive end.  And got some great contributions  from guys off the bench and we  all chipped in for this winner.  We got to talk about that shot"}, {"start": 5529, "end": 5540, "text": " you hit with about a minute left  the three.  You didn't even look in rhythm  there.  What were you thinking as the  ball left your hands.  You know just.  I put in a lot of work in my"}, {"start": 5539, "end": 5552, "text": " game.  You know.  You know after.  You know drape my finger to the  eye.  You know I was able to get three  three three rims out there.  So I just shot at the middle one  and I was able to."}, {"start": 5552, "end": 5563, "text": " The grace of the man above I was  able to knock it down.  When in doubt go for the middle  rim.  What did it feel like when you  were down there on the floor  when you took that hard fall  were you worried that you"}, {"start": 5562, "end": 5574, "text": " wouldn't be able to continue in  the game or have more problems.  You know I've been there before.  You know I've been poked in the  eye before you know on a rim  collision like that so.  Just try to keep my composure."}, {"start": 5573, "end": 5585, "text": " You know I'm not going to go to  the floor tonight I know that  for sure.  But we have a few days until we  do until we know when we'll go  to Phoenix but.  It's a big time win for us and I  definitely wasn't leaving the  floor no matter if I had to."}, {"start": 5585, "end": 5597, "text": " You know put a pirate a patch of  my eyes so.  I love this team I love to  compete.  One big rivalry down with this  win tonight but you've got  another one to go with an old"}, {"start": 5596, "end": 5608, "text": " friend in Chris Paul you  mentioned going to Phoenix and  facing the Suns.  What do you think that matchup  is going to be like.  You know they played extremely  well all year and they deserve  to you know host a you know home"}, {"start": 5607, "end": 5619, "text": " court in the first round and CP  you know played at an MVP  caliber year all year book you  know Aidan has grown all year  and they've given those guys a"}, {"start": 5618, "end": 5630, "text": " supporting cast around them so  you know we know what we're  going to get out of CP.  We know how good you know how  great CP is how great book is  up and coming surgeons from you"}, {"start": 5629, "end": 5640, "text": " know from Aiden you know but  it's the other guys as well  that we've got to make sure we  key in on because they've been  playing extremely well all year  and that's why they've been the  second best team in the world.  Thank you so much LeBron  congratulations."}, {"start": 5639, "end": 5642, "text": " We'll see you in Phoenix.  You know."}]